Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
#define USBHS_CTRLA_SWRST_Pos                 _UINT32_(0)                                          /* (USBHS_CTRLA) USBHS Software Reset Position */
#define USBHS_CTRLA_SWRST_Msk                 (_UINT32_(0x1) << USBHS_CTRLA_SWRST_Pos)             /* (USBHS_CTRLA) USBHS Software Reset Mask */
#define USBHS_CTRLA_SWRST(value)              (USBHS_CTRLA_SWRST_Msk & (_UINT32_(value) << USBHS_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the USBHS_CTRLA register */
#define USBHS_CTRLA_ENABLE_Pos                _UINT32_(1)                                          /* (USBHS_CTRLA) USBHS Enable Position */
#define USBHS_CTRLA_ENABLE_Msk                (_UINT32_(0x1) << USBHS_CTRLA_ENABLE_Pos)            /* (USBHS_CTRLA) USBHS Enable Mask */
#define USBHS_CTRLA_ENABLE(value)             (USBHS_CTRLA_ENABLE_Msk & (_UINT32_(value) << USBHS_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the USBHS_CTRLA register */
#define USBHS_CTRLA_IDVAL_Pos                 _UINT32_(8)                                          /* (USBHS_CTRLA) Override Valud of ID Position */
#define USBHS_CTRLA_IDVAL_Msk                 (_UINT32_(0x1) << USBHS_CTRLA_IDVAL_Pos)             /* (USBHS_CTRLA) Override Valud of ID Mask */
#define USBHS_CTRLA_IDVAL(value)              (USBHS_CTRLA_IDVAL_Msk & (_UINT32_(value) << USBHS_CTRLA_IDVAL_Pos)) /* Assigment of value for IDVAL in the USBHS_CTRLA register */
#define USBHS_CTRLA_IDOVEN_Pos                _UINT32_(9)                                          /* (USBHS_CTRLA) ID Source Select Position */
#define USBHS_CTRLA_IDOVEN_Msk                (_UINT32_(0x1) << USBHS_CTRLA_IDOVEN_Pos)            /* (USBHS_CTRLA) ID Source Select Mask */
#define USBHS_CTRLA_IDOVEN(value)             (USBHS_CTRLA_IDOVEN_Msk & (_UINT32_(value) << USBHS_CTRLA_IDOVEN_Pos)) /* Assigment of value for IDOVEN in the USBHS_CTRLA register */
#define USBHS_CTRLA_REFCLKSEL_Pos             _UINT32_(10)                                         /* (USBHS_CTRLA) Select USB PLL Reference Clock  Speed Position */
#define USBHS_CTRLA_REFCLKSEL_Msk             (_UINT32_(0x1) << USBHS_CTRLA_REFCLKSEL_Pos)         /* (USBHS_CTRLA) Select USB PLL Reference Clock  Speed Mask */
#define USBHS_CTRLA_REFCLKSEL(value)          (USBHS_CTRLA_REFCLKSEL_Msk & (_UINT32_(value) << USBHS_CTRLA_REFCLKSEL_Pos)) /* Assigment of value for REFCLKSEL in the USBHS_CTRLA register */
#define USBHS_CTRLA_Msk                       _UINT32_(0x00000703)                                 /* (USBHS_CTRLA) Register Mask  */


/* -------- USBHS_CTRLB : (USBHS Offset: 0x04) (R/W 32) USBHS Control Register B -------- */
#define USBHS_CTRLB_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLB) USBHS Control Register B  Reset Value */

#define USBHS_CTRLB_BLANK_Pos                 _UINT32_(0)                                          /* (USBHS_CTRLB) Blank the wakeup monitoring for a specific real time Position */
#define USBHS_CTRLB_BLANK_Msk                 (_UINT32_(0xFFFFF) << USBHS_CTRLB_BLANK_Pos)         /* (USBHS_CTRLB) Blank the wakeup monitoring for a specific real time Mask */
#define USBHS_CTRLB_BLANK(value)              (USBHS_CTRLB_BLANK_Msk & (_UINT32_(value) << USBHS_CTRLB_BLANK_Pos)) /* Assigment of value for BLANK in the USBHS_CTRLB register */
#define   USBHS_CTRLB_BLANK_BLANK0_Val        _UINT32_(0x0)                                        /* (USBHS_CTRLB) No blank delay  */
#define   USBHS_CTRLB_BLANK_BLANKMAX_Val      _UINT32_(0xFFFFF)                                    /* (USBHS_CTRLB) Maximum blank delay  */
#define USBHS_CTRLB_BLANK_BLANK0              (USBHS_CTRLB_BLANK_BLANK0_Val << USBHS_CTRLB_BLANK_Pos) /* (USBHS_CTRLB) No blank delay Position  */
#define USBHS_CTRLB_BLANK_BLANKMAX            (USBHS_CTRLB_BLANK_BLANKMAX_Val << USBHS_CTRLB_BLANK_Pos) /* (USBHS_CTRLB) Maximum blank delay Position  */
#define USBHS_CTRLB_Msk                       _UINT32_(0x000FFFFF)                                 /* (USBHS_CTRLB) Register Mask  */


/* -------- USBHS_CTRLC : (USBHS Offset: 0x08) (R/W 32) USBHS Control Register C -------- */
#define USBHS_CTRLC_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLC) USBHS Control Register C  Reset Value */

#define USBHS_CTRLC_T1MSEN_Pos                _UINT32_(4)                                          /* (USBHS_CTRLC) REFCLK and SUSPENDM override Position */
#define USBHS_CTRLC_T1MSEN_Msk                (_UINT32_(0x1) << USBHS_CTRLC_T1MSEN_Pos)            /* (USBHS_CTRLC) REFCLK and SUSPENDM override Mask */
#define USBHS_CTRLC_T1MSEN(value)             (USBHS_CTRLC_T1MSEN_Msk & (_UINT32_(value) << USBHS_CTRLC_T1MSEN_Pos)) /* Assigment of value for T1MSEN in the USBHS_CTRLC register */
#define USBHS_CTRLC_Msk                       _UINT32_(0x00000010)                                 /* (USBHS_CTRLC) Register Mask  */


/* -------- USBHS_INTENCLR : (USBHS Offset: 0x0C) (R/W 32) USBHS Interrupt Enable Clear Register -------- */
#define USBHS_INTENCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_INTENCLR) USBHS Interrupt Enable Clear Register  Reset Value */

#define USBHS_INTENCLR_WAKEUP_Pos             _UINT32_(0)                                          /* (USBHS_INTENCLR) Clear USCORE Detaction Interrupt Enable Position */
#define USBHS_INTENCLR_WAKEUP_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_WAKEUP_Pos)         /* (USBHS_INTENCLR) Clear USCORE Detaction Interrupt Enable Mask */
#define USBHS_INTENCLR_WAKEUP(value)          (USBHS_INTENCLR_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTENCLR_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_RESUME_Pos             _UINT32_(1)                                          /* (USBHS_INTENCLR) Clear Resume Interrupt Enable Position */
#define USBHS_INTENCLR_RESUME_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_RESUME_Pos)         /* (USBHS_INTENCLR) Clear Resume Interrupt Enable Mask */
#define USBHS_INTENCLR_RESUME(value)          (USBHS_INTENCLR_RESUME_Msk & (_UINT32_(value) << USBHS_INTENCLR_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_USB_Pos                _UINT32_(2)                                          /* (USBHS_INTENCLR) Clear USBCORE General Interrupt Enable Position */
#define USBHS_INTENCLR_USB_Msk                (_UINT32_(0x1) << USBHS_INTENCLR_USB_Pos)            /* (USBHS_INTENCLR) Clear USBCORE General Interrupt Enable Mask */
#define USBHS_INTENCLR_USB(value)             (USBHS_INTENCLR_USB_Msk & (_UINT32_(value) << USBHS_INTENCLR_USB_Pos)) /* Assigment of value for USB in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_DMA_Pos                _UINT32_(3)                                          /* (USBHS_INTENCLR) Clear DMA Interrupt Enable Position */
#define USBHS_INTENCLR_DMA_Msk                (_UINT32_(0x1) << USBHS_INTENCLR_DMA_Pos)            /* (USBHS_INTENCLR) Clear DMA Interrupt Enable Mask */
#define USBHS_INTENCLR_DMA(value)             (USBHS_INTENCLR_DMA_Msk & (_UINT32_(value) << USBHS_INTENCLR_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_T1MS_Pos               _UINT32_(4)                                          /* (USBHS_INTENCLR) Clear T1MS Interrupt Enable Position */
#define USBHS_INTENCLR_T1MS_Msk               (_UINT32_(0x1) << USBHS_INTENCLR_T1MS_Pos)           /* (USBHS_INTENCLR) Clear T1MS Interrupt Enable Mask */
#define USBHS_INTENCLR_T1MS(value)            (USBHS_INTENCLR_T1MS_Msk & (_UINT32_(value) << USBHS_INTENCLR_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_PHYRDY_Pos             _UINT32_(5)                                          /* (USBHS_INTENCLR) Clear PHYRDY Interrupt Enable Position */
#define USBHS_INTENCLR_PHYRDY_Msk             (_UINT32_(0x1) << USBHS_INTENCLR_PHYRDY_Pos)         /* (USBHS_INTENCLR) Clear PHYRDY Interrupt Enable Mask */
#define USBHS_INTENCLR_PHYRDY(value)          (USBHS_INTENCLR_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTENCLR_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTENCLR register */
#define USBHS_INTENCLR_Msk                    _UINT32_(0x0000003F)                                 /* (USBHS_INTENCLR) Register Mask  */


/* -------- USBHS_INTENSET : (USBHS Offset: 0x10) (R/W 32) USBHS Interrupt Enable Clear Register -------- */
#define USBHS_INTENSET_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_INTENSET) USBHS Interrupt Enable Clear Register  Reset Value */

#define USBHS_INTENSET_WAKEUP_Pos             _UINT32_(0)                                          /* (USBHS_INTENSET) USCORE Detaction Interrupt Enable Position */
#define USBHS_INTENSET_WAKEUP_Msk             (_UINT32_(0x1) << USBHS_INTENSET_WAKEUP_Pos)         /* (USBHS_INTENSET) USCORE Detaction Interrupt Enable Mask */
#define USBHS_INTENSET_WAKEUP(value)          (USBHS_INTENSET_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTENSET_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTENSET register */
#define USBHS_INTENSET_RESUME_Pos             _UINT32_(1)                                          /* (USBHS_INTENSET) Resume Interrupt Enable Position */
#define USBHS_INTENSET_RESUME_Msk             (_UINT32_(0x1) << USBHS_INTENSET_RESUME_Pos)         /* (USBHS_INTENSET) Resume Interrupt Enable Mask */
#define USBHS_INTENSET_RESUME(value)          (USBHS_INTENSET_RESUME_Msk & (_UINT32_(value) << USBHS_INTENSET_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTENSET register */
#define USBHS_INTENSET_USB_Pos                _UINT32_(2)                                          /* (USBHS_INTENSET) USBCORE General Interrupt Enable Position */
#define USBHS_INTENSET_USB_Msk                (_UINT32_(0x1) << USBHS_INTENSET_USB_Pos)            /* (USBHS_INTENSET) USBCORE General Interrupt Enable Mask */
#define USBHS_INTENSET_USB(value)             (USBHS_INTENSET_USB_Msk & (_UINT32_(value) << USBHS_INTENSET_USB_Pos)) /* Assigment of value for USB in the USBHS_INTENSET register */
#define USBHS_INTENSET_DMA_Pos                _UINT32_(3)                                          /* (USBHS_INTENSET) DMA Interrupt Enable Position */
#define USBHS_INTENSET_DMA_Msk                (_UINT32_(0x1) << USBHS_INTENSET_DMA_Pos)            /* (USBHS_INTENSET) DMA Interrupt Enable Mask */
#define USBHS_INTENSET_DMA(value)             (USBHS_INTENSET_DMA_Msk & (_UINT32_(value) << USBHS_INTENSET_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTENSET register */
#define USBHS_INTENSET_T1MS_Pos               _UINT32_(4)                                          /* (USBHS_INTENSET) T1MS Interrupt Enable Position */
#define USBHS_INTENSET_T1MS_Msk               (_UINT32_(0x1) << USBHS_INTENSET_T1MS_Pos)           /* (USBHS_INTENSET) T1MS Interrupt Enable Mask */
#define USBHS_INTENSET_T1MS(value)            (USBHS_INTENSET_T1MS_Msk & (_UINT32_(value) << USBHS_INTENSET_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTENSET register */
#define USBHS_INTENSET_PHYRDY_Pos             _UINT32_(5)                                          /* (USBHS_INTENSET) PHYRDY Interrupt Enable Position */
#define USBHS_INTENSET_PHYRDY_Msk             (_UINT32_(0x1) << USBHS_INTENSET_PHYRDY_Pos)         /* (USBHS_INTENSET) PHYRDY Interrupt Enable Mask */
#define USBHS_INTENSET_PHYRDY(value)          (USBHS_INTENSET_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTENSET_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTENSET register */
#define USBHS_INTENSET_Msk                    _UINT32_(0x0000003F)                                 /* (USBHS_INTENSET) Register Mask  */


