Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
/* -------- USBHS_FADDR : (USBHS Offset: 0x1000) (R/W 8) Function Address Register -------- */
#define USBHS_FADDR_RESETVALUE                _UINT8_(0x00)                                        /*  (USBHS_FADDR) Function Address Register  Reset Value */

#define USBHS_FADDR_FUNCADDR_Pos              _UINT8_(0)                                           /* (USBHS_FADDR) Function address Position */
#define USBHS_FADDR_FUNCADDR_Msk              (_UINT8_(0x7F) << USBHS_FADDR_FUNCADDR_Pos)          /* (USBHS_FADDR) Function address Mask */
#define USBHS_FADDR_FUNCADDR(value)           (USBHS_FADDR_FUNCADDR_Msk & (_UINT8_(value) << USBHS_FADDR_FUNCADDR_Pos)) /* Assigment of value for FUNCADDR in the USBHS_FADDR register */
#define USBHS_FADDR_Msk                       _UINT8_(0x7F)                                        /* (USBHS_FADDR) Register Mask  */


/* -------- USBHS_POWER : (USBHS Offset: 0x1001) (R/W 8) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE -------- */
#define USBHS_POWER_RESETVALUE                _UINT8_(0x20)                                        /*  (USBHS_POWER) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE  Reset Value */

#define USBHS_POWER_ENABLESUSPENDM_Pos        _UINT8_(0)                                           /* (USBHS_POWER) set by the cpu to enable suspendm output Position */
#define USBHS_POWER_ENABLESUSPENDM_Msk        (_UINT8_(0x1) << USBHS_POWER_ENABLESUSPENDM_Pos)     /* (USBHS_POWER) set by the cpu to enable suspendm output Mask */
#define USBHS_POWER_ENABLESUSPENDM(value)     (USBHS_POWER_ENABLESUSPENDM_Msk & (_UINT8_(value) << USBHS_POWER_ENABLESUSPENDM_Pos)) /* Assigment of value for ENABLESUSPENDM in the USBHS_POWER register */
#define USBHS_POWER_SUSPENDMODE_Pos           _UINT8_(1)                                           /* (USBHS_POWER) set by cpu to enter suspend mode Position */
#define USBHS_POWER_SUSPENDMODE_Msk           (_UINT8_(0x1) << USBHS_POWER_SUSPENDMODE_Pos)        /* (USBHS_POWER) set by cpu to enter suspend mode Mask */
#define USBHS_POWER_SUSPENDMODE(value)        (USBHS_POWER_SUSPENDMODE_Msk & (_UINT8_(value) << USBHS_POWER_SUSPENDMODE_Pos)) /* Assigment of value for SUSPENDMODE in the USBHS_POWER register */
#define USBHS_POWER_RESUME_Pos                _UINT8_(2)                                           /* (USBHS_POWER) set by cpu to generate resume signaling when te device is in suspend Position */
#define USBHS_POWER_RESUME_Msk                (_UINT8_(0x1) << USBHS_POWER_RESUME_Pos)             /* (USBHS_POWER) set by cpu to generate resume signaling when te device is in suspend Mask */
#define USBHS_POWER_RESUME(value)             (USBHS_POWER_RESUME_Msk & (_UINT8_(value) << USBHS_POWER_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_POWER register */
#define USBHS_POWER_RESET_Pos                 _UINT8_(3)                                           /* (USBHS_POWER) this bit is set when reset signaling is present on the bus Position */
#define USBHS_POWER_RESET_Msk                 (_UINT8_(0x1) << USBHS_POWER_RESET_Pos)              /* (USBHS_POWER) this bit is set when reset signaling is present on the bus Mask */
#define USBHS_POWER_RESET(value)              (USBHS_POWER_RESET_Msk & (_UINT8_(value) << USBHS_POWER_RESET_Pos)) /* Assigment of value for RESET in the USBHS_POWER register */
#define USBHS_POWER_HSMODE_Pos                _UINT8_(4)                                           /* (USBHS_POWER) when set this read only bit indicates high speed mode successfully negotiated during usb reset Position */
#define USBHS_POWER_HSMODE_Msk                (_UINT8_(0x1) << USBHS_POWER_HSMODE_Pos)             /* (USBHS_POWER) when set this read only bit indicates high speed mode successfully negotiated during usb reset Mask */
#define USBHS_POWER_HSMODE(value)             (USBHS_POWER_HSMODE_Msk & (_UINT8_(value) << USBHS_POWER_HSMODE_Pos)) /* Assigment of value for HSMODE in the USBHS_POWER register */
#define USBHS_POWER_HSENABLE_Pos              _UINT8_(5)                                           /* (USBHS_POWER) when set by cpu the usbcore will negotiate the high speed mode Position */
#define USBHS_POWER_HSENABLE_Msk              (_UINT8_(0x1) << USBHS_POWER_HSENABLE_Pos)           /* (USBHS_POWER) when set by cpu the usbcore will negotiate the high speed mode Mask */
#define USBHS_POWER_HSENABLE(value)           (USBHS_POWER_HSENABLE_Msk & (_UINT8_(value) << USBHS_POWER_HSENABLE_Pos)) /* Assigment of value for HSENABLE in the USBHS_POWER register */
#define USBHS_POWER_SOFTCONN_Pos              _UINT8_(6)                                           /* (USBHS_POWER) if enabled the D+ D- lines are enabled when this bit is set by the cpu Position */
#define USBHS_POWER_SOFTCONN_Msk              (_UINT8_(0x1) << USBHS_POWER_SOFTCONN_Pos)           /* (USBHS_POWER) if enabled the D+ D- lines are enabled when this bit is set by the cpu Mask */
#define USBHS_POWER_SOFTCONN(value)           (USBHS_POWER_SOFTCONN_Msk & (_UINT8_(value) << USBHS_POWER_SOFTCONN_Pos)) /* Assigment of value for SOFTCONN in the USBHS_POWER register */
#define USBHS_POWER_ISOUPDATE_Pos             _UINT8_(7)                                           /* (USBHS_POWER) when set by cpu the usbcore will wait for an sof token Position */
#define USBHS_POWER_ISOUPDATE_Msk             (_UINT8_(0x1) << USBHS_POWER_ISOUPDATE_Pos)          /* (USBHS_POWER) when set by cpu the usbcore will wait for an sof token Mask */
#define USBHS_POWER_ISOUPDATE(value)          (USBHS_POWER_ISOUPDATE_Msk & (_UINT8_(value) << USBHS_POWER_ISOUPDATE_Pos)) /* Assigment of value for ISOUPDATE in the USBHS_POWER register */
#define USBHS_POWER_Msk                       _UINT8_(0xFF)                                        /* (USBHS_POWER) Register Mask  */


/* -------- USBHS_INTRTX : (USBHS Offset: 0x1002) ( R/ 16) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15 -------- */
#define USBHS_INTRTX_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_INTRTX) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15  Reset Value */

