Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
#define USBHS_INTRTX_EP0TX_Pos                _UINT16_(0)                                          /* (USBHS_INTRTX) Interrupts Active For TX0 Endpoint Position */
#define USBHS_INTRTX_EP0TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP0TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX0 Endpoint Mask */
#define USBHS_INTRTX_EP0TX(value)             (USBHS_INTRTX_EP0TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP0TX_Pos)) /* Assigment of value for EP0TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP1TX_Pos                _UINT16_(1)                                          /* (USBHS_INTRTX) Interrupts Active For TX1 Endpoint Position */
#define USBHS_INTRTX_EP1TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP1TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX1 Endpoint Mask */
#define USBHS_INTRTX_EP1TX(value)             (USBHS_INTRTX_EP1TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP1TX_Pos)) /* Assigment of value for EP1TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP2TX_Pos                _UINT16_(2)                                          /* (USBHS_INTRTX) Interrupts Active For TX2 Endpoint Position */
#define USBHS_INTRTX_EP2TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP2TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX2 Endpoint Mask */
#define USBHS_INTRTX_EP2TX(value)             (USBHS_INTRTX_EP2TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP2TX_Pos)) /* Assigment of value for EP2TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP3TX_Pos                _UINT16_(3)                                          /* (USBHS_INTRTX) Interrupts Active For TX3 Endpoint Position */
#define USBHS_INTRTX_EP3TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP3TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX3 Endpoint Mask */
#define USBHS_INTRTX_EP3TX(value)             (USBHS_INTRTX_EP3TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP3TX_Pos)) /* Assigment of value for EP3TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP4TX_Pos                _UINT16_(4)                                          /* (USBHS_INTRTX) Interrupts Active For TX4 Endpoint Position */
#define USBHS_INTRTX_EP4TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP4TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX4 Endpoint Mask */
#define USBHS_INTRTX_EP4TX(value)             (USBHS_INTRTX_EP4TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP4TX_Pos)) /* Assigment of value for EP4TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP5TX_Pos                _UINT16_(5)                                          /* (USBHS_INTRTX) Interrupts Active For TX5 Endpoint Position */
#define USBHS_INTRTX_EP5TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP5TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX5 Endpoint Mask */
#define USBHS_INTRTX_EP5TX(value)             (USBHS_INTRTX_EP5TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP5TX_Pos)) /* Assigment of value for EP5TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP6TX_Pos                _UINT16_(6)                                          /* (USBHS_INTRTX) Interrupts Active For TX6 Endpoint Position */
#define USBHS_INTRTX_EP6TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP6TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX6 Endpoint Mask */
#define USBHS_INTRTX_EP6TX(value)             (USBHS_INTRTX_EP6TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP6TX_Pos)) /* Assigment of value for EP6TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_EP7TX_Pos                _UINT16_(7)                                          /* (USBHS_INTRTX) Interrupts Active For TX7 Endpoint Position */
#define USBHS_INTRTX_EP7TX_Msk                (_UINT16_(0x1) << USBHS_INTRTX_EP7TX_Pos)            /* (USBHS_INTRTX) Interrupts Active For TX7 Endpoint Mask */
#define USBHS_INTRTX_EP7TX(value)             (USBHS_INTRTX_EP7TX_Msk & (_UINT16_(value) << USBHS_INTRTX_EP7TX_Pos)) /* Assigment of value for EP7TX in the USBHS_INTRTX register */
#define USBHS_INTRTX_Msk                      _UINT16_(0x00FF)                                     /* (USBHS_INTRTX) Register Mask  */


/* -------- USBHS_INTRRX : (USBHS Offset: 0x1004) ( R/ 16) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15 -------- */
#define USBHS_INTRRX_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_INTRRX) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15  Reset Value */

#define USBHS_INTRRX_EP1RX_Pos                _UINT16_(1)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX1 Endpoint Position */
#define USBHS_INTRRX_EP1RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP1RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX1 Endpoint Mask */
#define USBHS_INTRRX_EP1RX(value)             (USBHS_INTRRX_EP1RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP1RX_Pos)) /* Assigment of value for EP1RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP2RX_Pos                _UINT16_(2)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX2 Endpoint Position */
#define USBHS_INTRRX_EP2RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP2RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX2 Endpoint Mask */
#define USBHS_INTRRX_EP2RX(value)             (USBHS_INTRRX_EP2RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP2RX_Pos)) /* Assigment of value for EP2RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP3RX_Pos                _UINT16_(3)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX3 Endpoint Position */
#define USBHS_INTRRX_EP3RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP3RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX3 Endpoint Mask */
#define USBHS_INTRRX_EP3RX(value)             (USBHS_INTRRX_EP3RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP3RX_Pos)) /* Assigment of value for EP3RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP4RX_Pos                _UINT16_(4)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX4 Endpoint Position */
#define USBHS_INTRRX_EP4RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP4RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX4 Endpoint Mask */
#define USBHS_INTRRX_EP4RX(value)             (USBHS_INTRRX_EP4RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP4RX_Pos)) /* Assigment of value for EP4RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP5RX_Pos                _UINT16_(5)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX5 Endpoint Position */
#define USBHS_INTRRX_EP5RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP5RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX5 Endpoint Mask */
#define USBHS_INTRRX_EP5RX(value)             (USBHS_INTRRX_EP5RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP5RX_Pos)) /* Assigment of value for EP5RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP6RX_Pos                _UINT16_(6)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX6 Endpoint Position */
#define USBHS_INTRRX_EP6RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP6RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX6 Endpoint Mask */
#define USBHS_INTRRX_EP6RX(value)             (USBHS_INTRRX_EP6RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP6RX_Pos)) /* Assigment of value for EP6RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_EP7RX_Pos                _UINT16_(7)                                          /* (USBHS_INTRRX) Interrupts Active For Which RX7 Endpoint Position */
#define USBHS_INTRRX_EP7RX_Msk                (_UINT16_(0x1) << USBHS_INTRRX_EP7RX_Pos)            /* (USBHS_INTRRX) Interrupts Active For Which RX7 Endpoint Mask */
#define USBHS_INTRRX_EP7RX(value)             (USBHS_INTRRX_EP7RX_Msk & (_UINT16_(value) << USBHS_INTRRX_EP7RX_Pos)) /* Assigment of value for EP7RX in the USBHS_INTRRX register */
#define USBHS_INTRRX_Msk                      _UINT16_(0x00FE)                                     /* (USBHS_INTRRX) Register Mask  */


/* -------- USBHS_INTRTXE : (USBHS Offset: 0x1006) (R/W 16) Interrupt Enable Bits for INTRTX -------- */
#define USBHS_INTRTXE_RESETVALUE              _UINT16_(0xFFFF)                                     /*  (USBHS_INTRTXE) Interrupt Enable Bits for INTRTX  Reset Value */

#define USBHS_INTRTXE_EP0TXEN_Pos             _UINT16_(0)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP0 Position */
#define USBHS_INTRTXE_EP0TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP0TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP0 Mask */
#define USBHS_INTRTXE_EP0TXEN(value)          (USBHS_INTRTXE_EP0TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP0TXEN_Pos)) /* Assigment of value for EP0TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP1TXEN_Pos             _UINT16_(1)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP1 Position */
#define USBHS_INTRTXE_EP1TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP1TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP1 Mask */
#define USBHS_INTRTXE_EP1TXEN(value)          (USBHS_INTRTXE_EP1TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP1TXEN_Pos)) /* Assigment of value for EP1TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP2TXEN_Pos             _UINT16_(2)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP2 Position */
#define USBHS_INTRTXE_EP2TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP2TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP2 Mask */
#define USBHS_INTRTXE_EP2TXEN(value)          (USBHS_INTRTXE_EP2TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP2TXEN_Pos)) /* Assigment of value for EP2TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP3TXEN_Pos             _UINT16_(3)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP3 Position */
#define USBHS_INTRTXE_EP3TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP3TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP3 Mask */
#define USBHS_INTRTXE_EP3TXEN(value)          (USBHS_INTRTXE_EP3TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP3TXEN_Pos)) /* Assigment of value for EP3TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP4TXEN_Pos             _UINT16_(4)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP4 Position */
#define USBHS_INTRTXE_EP4TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP4TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP4 Mask */
#define USBHS_INTRTXE_EP4TXEN(value)          (USBHS_INTRTXE_EP4TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP4TXEN_Pos)) /* Assigment of value for EP4TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP5TXEN_Pos             _UINT16_(5)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP5 Position */
#define USBHS_INTRTXE_EP5TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP5TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP5 Mask */
#define USBHS_INTRTXE_EP5TXEN(value)          (USBHS_INTRTXE_EP5TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP5TXEN_Pos)) /* Assigment of value for EP5TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP6TXEN_Pos             _UINT16_(6)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP6 Position */
#define USBHS_INTRTXE_EP6TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP6TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP6 Mask */
#define USBHS_INTRTXE_EP6TXEN(value)          (USBHS_INTRTXE_EP6TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP6TXEN_Pos)) /* Assigment of value for EP6TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_EP7TXEN_Pos             _UINT16_(7)                                          /* (USBHS_INTRTXE) Interrupt Enabled for TX EP7 Position */
#define USBHS_INTRTXE_EP7TXEN_Msk             (_UINT16_(0x1) << USBHS_INTRTXE_EP7TXEN_Pos)         /* (USBHS_INTRTXE) Interrupt Enabled for TX EP7 Mask */
#define USBHS_INTRTXE_EP7TXEN(value)          (USBHS_INTRTXE_EP7TXEN_Msk & (_UINT16_(value) << USBHS_INTRTXE_EP7TXEN_Pos)) /* Assigment of value for EP7TXEN in the USBHS_INTRTXE register */
#define USBHS_INTRTXE_Msk                     _UINT16_(0x00FF)                                     /* (USBHS_INTRTXE) Register Mask  */


