Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
#define USBHS_INTRUSBE_SUSPENDEN_Pos          _UINT8_(0)                                           /* (USBHS_INTRUSBE) SUSEPND Interrupt Enable Position */
#define USBHS_INTRUSBE_SUSPENDEN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_SUSPENDEN_Pos)       /* (USBHS_INTRUSBE) SUSEPND Interrupt Enable Mask */
#define USBHS_INTRUSBE_SUSPENDEN(value)       (USBHS_INTRUSBE_SUSPENDEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SUSPENDEN_Pos)) /* Assigment of value for SUSPENDEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_RESUMEEN_Pos           _UINT8_(1)                                           /* (USBHS_INTRUSBE) RESUME Interrupt Enable Position */
#define USBHS_INTRUSBE_RESUMEEN_Msk           (_UINT8_(0x1) << USBHS_INTRUSBE_RESUMEEN_Pos)        /* (USBHS_INTRUSBE) RESUME Interrupt Enable Mask */
#define USBHS_INTRUSBE_RESUMEEN(value)        (USBHS_INTRUSBE_RESUMEEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_RESUMEEN_Pos)) /* Assigment of value for RESUMEEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_RESETEN_Pos            _UINT8_(2)                                           /* (USBHS_INTRUSBE) RESET/BABBLE Interrupt Enable Position */
#define USBHS_INTRUSBE_RESETEN_Msk            (_UINT8_(0x1) << USBHS_INTRUSBE_RESETEN_Pos)         /* (USBHS_INTRUSBE) RESET/BABBLE Interrupt Enable Mask */
#define USBHS_INTRUSBE_RESETEN(value)         (USBHS_INTRUSBE_RESETEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_RESETEN_Pos)) /* Assigment of value for RESETEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_SOFEN_Pos              _UINT8_(3)                                           /* (USBHS_INTRUSBE) SOF Interrupt Enable Position */
#define USBHS_INTRUSBE_SOFEN_Msk              (_UINT8_(0x1) << USBHS_INTRUSBE_SOFEN_Pos)           /* (USBHS_INTRUSBE) SOF Interrupt Enable Mask */
#define USBHS_INTRUSBE_SOFEN(value)           (USBHS_INTRUSBE_SOFEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SOFEN_Pos)) /* Assigment of value for SOFEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_CONNEN_Pos             _UINT8_(4)                                           /* (USBHS_INTRUSBE) CONN Interrupt Enable Position */
#define USBHS_INTRUSBE_CONNEN_Msk             (_UINT8_(0x1) << USBHS_INTRUSBE_CONNEN_Pos)          /* (USBHS_INTRUSBE) CONN Interrupt Enable Mask */
#define USBHS_INTRUSBE_CONNEN(value)          (USBHS_INTRUSBE_CONNEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_CONNEN_Pos)) /* Assigment of value for CONNEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_DISCONEN_Pos           _UINT8_(5)                                           /* (USBHS_INTRUSBE) DISCONN Interrupt Enable Position */
#define USBHS_INTRUSBE_DISCONEN_Msk           (_UINT8_(0x1) << USBHS_INTRUSBE_DISCONEN_Pos)        /* (USBHS_INTRUSBE) DISCONN Interrupt Enable Mask */
#define USBHS_INTRUSBE_DISCONEN(value)        (USBHS_INTRUSBE_DISCONEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_DISCONEN_Pos)) /* Assigment of value for DISCONEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_SESSREQEN_Pos          _UINT8_(6)                                           /* (USBHS_INTRUSBE) SESSREQ Interrupt Enable Position */
#define USBHS_INTRUSBE_SESSREQEN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_SESSREQEN_Pos)       /* (USBHS_INTRUSBE) SESSREQ Interrupt Enable Mask */
#define USBHS_INTRUSBE_SESSREQEN(value)       (USBHS_INTRUSBE_SESSREQEN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_SESSREQEN_Pos)) /* Assigment of value for SESSREQEN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_VBUSERREN_Pos          _UINT8_(7)                                           /* (USBHS_INTRUSBE) VBus Error Interrupt Enable Position */
#define USBHS_INTRUSBE_VBUSERREN_Msk          (_UINT8_(0x1) << USBHS_INTRUSBE_VBUSERREN_Pos)       /* (USBHS_INTRUSBE) VBus Error Interrupt Enable Mask */
#define USBHS_INTRUSBE_VBUSERREN(value)       (USBHS_INTRUSBE_VBUSERREN_Msk & (_UINT8_(value) << USBHS_INTRUSBE_VBUSERREN_Pos)) /* Assigment of value for VBUSERREN in the USBHS_INTRUSBE register */
#define USBHS_INTRUSBE_Msk                    _UINT8_(0xFF)                                        /* (USBHS_INTRUSBE) Register Mask  */


/* -------- USBHS_FRAME : (USBHS Offset: 0x100C) ( R/ 16) Holds The Last Received Frame Number -------- */
#define USBHS_FRAME_RESETVALUE                _UINT16_(0x00)                                       /*  (USBHS_FRAME) Holds The Last Received Frame Number  Reset Value */

#define USBHS_FRAME_FRMNUM_Pos                _UINT16_(0)                                          /* (USBHS_FRAME) Frame Number Position */
#define USBHS_FRAME_FRMNUM_Msk                (_UINT16_(0x7FF) << USBHS_FRAME_FRMNUM_Pos)          /* (USBHS_FRAME) Frame Number Mask */
#define USBHS_FRAME_FRMNUM(value)             (USBHS_FRAME_FRMNUM_Msk & (_UINT16_(value) << USBHS_FRAME_FRMNUM_Pos)) /* Assigment of value for FRMNUM in the USBHS_FRAME register */
#define USBHS_FRAME_Msk                       _UINT16_(0x07FF)                                     /* (USBHS_FRAME) Register Mask  */


/* -------- USBHS_INDEX : (USBHS Offset: 0x100E) (R/W 8) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed -------- */
#define USBHS_INDEX_RESETVALUE                _UINT8_(0x00)                                        /*  (USBHS_INDEX) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed  Reset Value */

#define USBHS_INDEX_SELEP_Pos                 _UINT8_(0)                                           /* (USBHS_INDEX) The Selected Endpoint Position */
#define USBHS_INDEX_SELEP_Msk                 (_UINT8_(0xF) << USBHS_INDEX_SELEP_Pos)              /* (USBHS_INDEX) The Selected Endpoint Mask */
#define USBHS_INDEX_SELEP(value)              (USBHS_INDEX_SELEP_Msk & (_UINT8_(value) << USBHS_INDEX_SELEP_Pos)) /* Assigment of value for SELEP in the USBHS_INDEX register */
#define   USBHS_INDEX_SELEP_EP0_Val           _UINT8_(0x0)                                         /* (USBHS_INDEX) Endpoint 0 Select  */
#define   USBHS_INDEX_SELEP_EP1_Val           _UINT8_(0x1)                                         /* (USBHS_INDEX) Endpoint 1 Select  */
#define   USBHS_INDEX_SELEP_EP2_Val           _UINT8_(0x2)                                         /* (USBHS_INDEX) Endpoint 2 Select  */
#define   USBHS_INDEX_SELEP_EP3_Val           _UINT8_(0x3)                                         /* (USBHS_INDEX) Endpoint 3 Select  */
#define   USBHS_INDEX_SELEP_EP4_Val           _UINT8_(0x4)                                         /* (USBHS_INDEX) Endpoint 4 Select  */
#define   USBHS_INDEX_SELEP_EP5_Val           _UINT8_(0x5)                                         /* (USBHS_INDEX) Endpoint 5 Select  */
#define   USBHS_INDEX_SELEP_EP6_Val           _UINT8_(0x6)                                         /* (USBHS_INDEX) Endpoint 6 Select  */
#define   USBHS_INDEX_SELEP_EP7_Val           _UINT8_(0x7)                                         /* (USBHS_INDEX) Endpoint 7 Select  */
#define   USBHS_INDEX_SELEP_EP8_Val           _UINT8_(0x8)                                         /* (USBHS_INDEX) Endpoint 8 Select  */
#define USBHS_INDEX_SELEP_EP0                 (USBHS_INDEX_SELEP_EP0_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 0 Select Position  */
#define USBHS_INDEX_SELEP_EP1                 (USBHS_INDEX_SELEP_EP1_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 1 Select Position  */
#define USBHS_INDEX_SELEP_EP2                 (USBHS_INDEX_SELEP_EP2_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 2 Select Position  */
#define USBHS_INDEX_SELEP_EP3                 (USBHS_INDEX_SELEP_EP3_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 3 Select Position  */
#define USBHS_INDEX_SELEP_EP4                 (USBHS_INDEX_SELEP_EP4_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 4 Select Position  */
#define USBHS_INDEX_SELEP_EP5                 (USBHS_INDEX_SELEP_EP5_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 5 Select Position  */
#define USBHS_INDEX_SELEP_EP6                 (USBHS_INDEX_SELEP_EP6_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 6 Select Position  */
#define USBHS_INDEX_SELEP_EP7                 (USBHS_INDEX_SELEP_EP7_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 7 Select Position  */
#define USBHS_INDEX_SELEP_EP8                 (USBHS_INDEX_SELEP_EP8_Val << USBHS_INDEX_SELEP_Pos) /* (USBHS_INDEX) Endpoint 8 Select Position  */
#define USBHS_INDEX_Msk                       _UINT8_(0x0F)                                        /* (USBHS_INDEX) Register Mask  */


/* -------- USBHS_TESTMODE : (USBHS Offset: 0x100F) (R/W 8) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation -------- */
#define USBHS_TESTMODE_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_TESTMODE) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation  Reset Value */

#define USBHS_TESTMODE_TESTSE0NAK_Pos         _UINT8_(0)                                           /* (USBHS_TESTMODE) Set To Enter The Test_SE0_NAK mode Position */
#define USBHS_TESTMODE_TESTSE0NAK_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_TESTSE0NAK_Pos)      /* (USBHS_TESTMODE) Set To Enter The Test_SE0_NAK mode Mask */
#define USBHS_TESTMODE_TESTSE0NAK(value)      (USBHS_TESTMODE_TESTSE0NAK_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTSE0NAK_Pos)) /* Assigment of value for TESTSE0NAK in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTJ_Pos              _UINT8_(1)                                           /* (USBHS_TESTMODE) Set To Enter The Test_J mode Position */
#define USBHS_TESTMODE_TESTJ_Msk              (_UINT8_(0x1) << USBHS_TESTMODE_TESTJ_Pos)           /* (USBHS_TESTMODE) Set To Enter The Test_J mode Mask */
#define USBHS_TESTMODE_TESTJ(value)           (USBHS_TESTMODE_TESTJ_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTJ_Pos)) /* Assigment of value for TESTJ in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTK_Pos              _UINT8_(2)                                           /* (USBHS_TESTMODE) Set To Enter The Test_K mode Position */
#define USBHS_TESTMODE_TESTK_Msk              (_UINT8_(0x1) << USBHS_TESTMODE_TESTK_Pos)           /* (USBHS_TESTMODE) Set To Enter The Test_K mode Mask */
#define USBHS_TESTMODE_TESTK(value)           (USBHS_TESTMODE_TESTK_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTK_Pos)) /* Assigment of value for TESTK in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_TESTPACKET_Pos         _UINT8_(3)                                           /* (USBHS_TESTMODE) Set To Enter The Test_Packet mode Position */
#define USBHS_TESTMODE_TESTPACKET_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_TESTPACKET_Pos)      /* (USBHS_TESTMODE) Set To Enter The Test_Packet mode Mask */
#define USBHS_TESTMODE_TESTPACKET(value)      (USBHS_TESTMODE_TESTPACKET_Msk & (_UINT8_(value) << USBHS_TESTMODE_TESTPACKET_Pos)) /* Assigment of value for TESTPACKET in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEHS_Pos            _UINT8_(4)                                           /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into High Speed Mode Position */
#define USBHS_TESTMODE_FORCEHS_Msk            (_UINT8_(0x1) << USBHS_TESTMODE_FORCEHS_Pos)         /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into High Speed Mode Mask */
#define USBHS_TESTMODE_FORCEHS(value)         (USBHS_TESTMODE_FORCEHS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEHS_Pos)) /* Assigment of value for FORCEHS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEFS_Pos            _UINT8_(5)                                           /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into FS Speed Mode Position */
#define USBHS_TESTMODE_FORCEFS_Msk            (_UINT8_(0x1) << USBHS_TESTMODE_FORCEFS_Pos)         /* (USBHS_TESTMODE) Depending On Bit 7 Force Controller Into FS Speed Mode Mask */
#define USBHS_TESTMODE_FORCEFS(value)         (USBHS_TESTMODE_FORCEFS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEFS_Pos)) /* Assigment of value for FORCEFS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FIFOACCESS_Pos         _UINT8_(6)                                           /* (USBHS_TESTMODE) The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically. Position */
#define USBHS_TESTMODE_FIFOACCESS_Msk         (_UINT8_(0x1) << USBHS_TESTMODE_FIFOACCESS_Pos)      /* (USBHS_TESTMODE) The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically. Mask */
#define USBHS_TESTMODE_FIFOACCESS(value)      (USBHS_TESTMODE_FIFOACCESS_Msk & (_UINT8_(value) << USBHS_TESTMODE_FIFOACCESS_Pos)) /* Assigment of value for FIFOACCESS in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_FORCEHOST_Pos          _UINT8_(7)                                           /* (USBHS_TESTMODE) The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set Position */
#define USBHS_TESTMODE_FORCEHOST_Msk          (_UINT8_(0x1) << USBHS_TESTMODE_FORCEHOST_Pos)       /* (USBHS_TESTMODE) The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set Mask */
#define USBHS_TESTMODE_FORCEHOST(value)       (USBHS_TESTMODE_FORCEHOST_Msk & (_UINT8_(value) << USBHS_TESTMODE_FORCEHOST_Pos)) /* Assigment of value for FORCEHOST in the USBHS_TESTMODE register */
#define USBHS_TESTMODE_Msk                    _UINT8_(0xFF)                                        /* (USBHS_TESTMODE) Register Mask  */


