Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
/* -------- USBHS_ENDPOINTX_RXCOUNT : (USBHS Offset: 0x1018) ( R/ 16) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. -------- */
#define USBHS_ENDPOINTX_RXCOUNT_RESETVALUE    _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_RXCOUNT) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.  Reset Value */

#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_RXCOUNT) Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. Position */
#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Msk (_UINT16_(0x3FFF) << USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos) /* (USBHS_ENDPOINTX_RXCOUNT) Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. Mask */
#define USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT(value) (USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXCOUNT_ENDPOINTRXCOUNT_Pos)) /* Assigment of value for ENDPOINTRXCOUNT in the USBHS_ENDPOINTX_RXCOUNT register */
#define USBHS_ENDPOINTX_RXCOUNT_Msk           _UINT16_(0x3FFF)                                     /* (USBHS_ENDPOINTX_RXCOUNT) Register Mask  */


/* -------- USBHS_ENDPOINT0_COUNT0 : (USBHS Offset: 0x1018) ( R/ 8) ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO -------- */
#define USBHS_ENDPOINT0_COUNT0_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_COUNT0) ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO  Reset Value */

#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_COUNT0) Number Of Received Data Bytes In Endpoint 0 FIFO Position */
#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Msk (_UINT8_(0x7F) << USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos) /* (USBHS_ENDPOINT0_COUNT0) Number Of Received Data Bytes In Endpoint 0 FIFO Mask */
#define USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT(value) (USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_COUNT0_EP0RXCOUNT_Pos)) /* Assigment of value for EP0RXCOUNT in the USBHS_ENDPOINT0_COUNT0 register */
#define USBHS_ENDPOINT0_COUNT0_Msk            _UINT8_(0x7F)                                        /* (USBHS_ENDPOINT0_COUNT0) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXTYPE : (USBHS Offset: 0x101A) (R/W 8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint -------- */
#define USBHS_ENDPOINTX_TXTYPE_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint  Reset Value */

#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this value to the endpoint number contained in the tx endpoint descriptor Position */
#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos) /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this value to the endpoint number contained in the tx endpoint descriptor Mask */
#define USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER(value) (USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_ENDPOINTNUMBER_Pos)) /* Assigment of value for ENDPOINTNUMBER in the USBHS_ENDPOINTX_TXTYPE register */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos   _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Position */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Msk   (_UINT8_(0x3) << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE) the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Mask */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL(value) (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos)) /* Assigment of value for PROTOCOL in the USBHS_ENDPOINTX_TXTYPE register */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define   USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_TXTYPE)   */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_CONTROL_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_ISOCHRONOUS_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK  (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_BULK_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT (USBHS_ENDPOINTX_TXTYPE_PROTOCOL_INTERRUPT_Val << USBHS_ENDPOINTX_TXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_TXTYPE)  Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_Pos      _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Position */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_Msk      (_UINT8_(0x3) << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos)   /* (USBHS_ENDPOINTX_TXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Mask */
#define USBHS_ENDPOINTX_TXTYPE_SPEED(value)   (USBHS_ENDPOINTX_TXTYPE_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINTX_TXTYPE register */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In High Speed  */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In Full Speed  */
#define   USBHS_ENDPOINTX_TXTYPE_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_TXTYPE) Device In Low Speed  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH     (USBHS_ENDPOINTX_TXTYPE_SPEED_HIGH_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In High Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_FULL     (USBHS_ENDPOINTX_TXTYPE_SPEED_FULL_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In Full Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_SPEED_LOW      (USBHS_ENDPOINTX_TXTYPE_SPEED_LOW_Val << USBHS_ENDPOINTX_TXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_TXTYPE) Device In Low Speed Position  */
#define USBHS_ENDPOINTX_TXTYPE_Msk            _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_TXTYPE) Register Mask  */


/* -------- USBHS_ENDPOINT0_TYPE0 : (USBHS Offset: 0x101A) (R/W 8) ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device -------- */
#define USBHS_ENDPOINT0_TYPE0_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_TYPE0) ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device  Reset Value */

#define USBHS_ENDPOINT0_TYPE0_SPEED_Pos       _UINT8_(6)                                           /* (USBHS_ENDPOINT0_TYPE0) Operating Speed Of The Target Device Position */
#define USBHS_ENDPOINT0_TYPE0_SPEED_Msk       (_UINT8_(0x3) << USBHS_ENDPOINT0_TYPE0_SPEED_Pos)    /* (USBHS_ENDPOINT0_TYPE0) Operating Speed Of The Target Device Mask */
#define USBHS_ENDPOINT0_TYPE0_SPEED(value)    (USBHS_ENDPOINT0_TYPE0_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_TYPE0_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINT0_TYPE0 register */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In High Speed  */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In Full Speed  */
#define   USBHS_ENDPOINT0_TYPE0_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINT0_TYPE0) Device In Low Speed  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_HIGH      (USBHS_ENDPOINT0_TYPE0_SPEED_HIGH_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In High Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_FULL      (USBHS_ENDPOINT0_TYPE0_SPEED_FULL_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In Full Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_SPEED_LOW       (USBHS_ENDPOINT0_TYPE0_SPEED_LOW_Val << USBHS_ENDPOINT0_TYPE0_SPEED_Pos) /* (USBHS_ENDPOINT0_TYPE0) Device In Low Speed Position  */
#define USBHS_ENDPOINT0_TYPE0_Msk             _UINT8_(0xC0)                                        /* (USBHS_ENDPOINT0_TYPE0) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXINTERVAL : (USBHS Offset: 0x101B) (R/W 8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint. -------- */
#define USBHS_ENDPOINTX_TXINTERVAL_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint.  Reset Value */

#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXINTERVAL) polling interval Position */
#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Msk (_UINT8_(0xFF) << USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos) /* (USBHS_ENDPOINTX_TXINTERVAL) polling interval Mask */
#define USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL(value) (USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXINTERVAL_TXPOLLINGINTERVAL_Pos)) /* Assigment of value for TXPOLLINGINTERVAL in the USBHS_ENDPOINTX_TXINTERVAL register */
#define USBHS_ENDPOINTX_TXINTERVAL_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_TXINTERVAL) Register Mask  */


/* -------- USBHS_ENDPOINT0_NAKLIMIT0 : (USBHS Offset: 0x101B) (R/W 8) ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0. -------- */
#define USBHS_ENDPOINT0_NAKLIMIT0_RESETVALUE  _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_NAKLIMIT0) ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0.  Reset Value */

#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_NAKLIMIT0) Number Of Frames/Microframes After Which Endpoint 0 Should Timeout Position */
#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Msk (_UINT8_(0x1F) << USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos) /* (USBHS_ENDPOINT0_NAKLIMIT0) Number Of Frames/Microframes After Which Endpoint 0 Should Timeout Mask */
#define USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT(value) (USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_NAKLIMIT0_EP0NAKLIMIT_Pos)) /* Assigment of value for EP0NAKLIMIT in the USBHS_ENDPOINT0_NAKLIMIT0 register */
#define USBHS_ENDPOINT0_NAKLIMIT0_Msk         _UINT8_(0x1F)                                        /* (USBHS_ENDPOINT0_NAKLIMIT0) Register Mask  */


