Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
/* -------- USBHS_RXFIFOSZ : (USBHS Offset: 0x1063) (R/W 8) Controls The Size Of The Selected RX Endpoint FIFO -------- */
#define USBHS_RXFIFOSZ_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_RXFIFOSZ) Controls The Size Of The Selected RX Endpoint FIFO  Reset Value */

#define USBHS_RXFIFOSZ_SZ_Pos                 _UINT8_(0)                                           /* (USBHS_RXFIFOSZ) maximum packet size to be allowed Position */
#define USBHS_RXFIFOSZ_SZ_Msk                 (_UINT8_(0xF) << USBHS_RXFIFOSZ_SZ_Pos)              /* (USBHS_RXFIFOSZ) maximum packet size to be allowed Mask */
#define USBHS_RXFIFOSZ_SZ(value)              (USBHS_RXFIFOSZ_SZ_Msk & (_UINT8_(value) << USBHS_RXFIFOSZ_SZ_Pos)) /* Assigment of value for SZ in the USBHS_RXFIFOSZ register */
#define   USBHS_RXFIFOSZ_SZ_8BYTES_Val        _UINT8_(0x0)                                         /* (USBHS_RXFIFOSZ) 8 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_16BYTES_Val       _UINT8_(0x1)                                         /* (USBHS_RXFIFOSZ) 16 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_32BYTES_Val       _UINT8_(0x2)                                         /* (USBHS_RXFIFOSZ) 32 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_64BYTES_Val       _UINT8_(0x3)                                         /* (USBHS_RXFIFOSZ) 64 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_128BYTES_Val      _UINT8_(0x4)                                         /* (USBHS_RXFIFOSZ) 128 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_256BYTES_Val      _UINT8_(0x5)                                         /* (USBHS_RXFIFOSZ) 256 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_512BYTES_Val      _UINT8_(0x6)                                         /* (USBHS_RXFIFOSZ) 512 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_1024BYTES_Val     _UINT8_(0x7)                                         /* (USBHS_RXFIFOSZ) 1024 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_2048BYTES_Val     _UINT8_(0x8)                                         /* (USBHS_RXFIFOSZ) 2048 BYTES  */
#define   USBHS_RXFIFOSZ_SZ_4096BYTES_Val     _UINT8_(0x9)                                         /* (USBHS_RXFIFOSZ) 4096 BYTES  */
#define USBHS_RXFIFOSZ_SZ_8BYTES              (USBHS_RXFIFOSZ_SZ_8BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 8 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_16BYTES             (USBHS_RXFIFOSZ_SZ_16BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 16 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_32BYTES             (USBHS_RXFIFOSZ_SZ_32BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 32 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_64BYTES             (USBHS_RXFIFOSZ_SZ_64BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 64 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_128BYTES            (USBHS_RXFIFOSZ_SZ_128BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 128 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_256BYTES            (USBHS_RXFIFOSZ_SZ_256BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 256 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_512BYTES            (USBHS_RXFIFOSZ_SZ_512BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 512 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_1024BYTES           (USBHS_RXFIFOSZ_SZ_1024BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 1024 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_2048BYTES           (USBHS_RXFIFOSZ_SZ_2048BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 2048 BYTES Position  */
#define USBHS_RXFIFOSZ_SZ_4096BYTES           (USBHS_RXFIFOSZ_SZ_4096BYTES_Val << USBHS_RXFIFOSZ_SZ_Pos) /* (USBHS_RXFIFOSZ) 4096 BYTES Position  */
#define USBHS_RXFIFOSZ_DPB_Pos                _UINT8_(4)                                           /* (USBHS_RXFIFOSZ) double packet buffering enabled or not Position */
#define USBHS_RXFIFOSZ_DPB_Msk                (_UINT8_(0x1) << USBHS_RXFIFOSZ_DPB_Pos)             /* (USBHS_RXFIFOSZ) double packet buffering enabled or not Mask */
#define USBHS_RXFIFOSZ_DPB(value)             (USBHS_RXFIFOSZ_DPB_Msk & (_UINT8_(value) << USBHS_RXFIFOSZ_DPB_Pos)) /* Assigment of value for DPB in the USBHS_RXFIFOSZ register */
#define USBHS_RXFIFOSZ_Msk                    _UINT8_(0x1F)                                        /* (USBHS_RXFIFOSZ) Register Mask  */


/* -------- USBHS_TXFIFOADD : (USBHS Offset: 0x1064) (R/W 16) Controls The Start Address Of the Selected TX Endpoint FIFO -------- */
#define USBHS_TXFIFOADD_RESETVALUE            _UINT16_(0x00)                                       /*  (USBHS_TXFIFOADD) Controls The Start Address Of the Selected TX Endpoint FIFO  Reset Value */

#define USBHS_TXFIFOADD_ADDR_Pos              _UINT16_(0)                                          /* (USBHS_TXFIFOADD) start address of the endpoint FIFO Position */
#define USBHS_TXFIFOADD_ADDR_Msk              (_UINT16_(0x1FFF) << USBHS_TXFIFOADD_ADDR_Pos)       /* (USBHS_TXFIFOADD) start address of the endpoint FIFO Mask */
#define USBHS_TXFIFOADD_ADDR(value)           (USBHS_TXFIFOADD_ADDR_Msk & (_UINT16_(value) << USBHS_TXFIFOADD_ADDR_Pos)) /* Assigment of value for ADDR in the USBHS_TXFIFOADD register */
#define USBHS_TXFIFOADD_Msk                   _UINT16_(0x1FFF)                                     /* (USBHS_TXFIFOADD) Register Mask  */


/* -------- USBHS_RXFIFOADD : (USBHS Offset: 0x1066) (R/W 16) Controls The Start Address Of the Selected RX Endpoint FIFO -------- */
#define USBHS_RXFIFOADD_RESETVALUE            _UINT16_(0x00)                                       /*  (USBHS_RXFIFOADD) Controls The Start Address Of the Selected RX Endpoint FIFO  Reset Value */

#define USBHS_RXFIFOADD_ADDR_Pos              _UINT16_(0)                                          /* (USBHS_RXFIFOADD) start address of the endpoint FIFO Position */
#define USBHS_RXFIFOADD_ADDR_Msk              (_UINT16_(0x1FFF) << USBHS_RXFIFOADD_ADDR_Pos)       /* (USBHS_RXFIFOADD) start address of the endpoint FIFO Mask */
#define USBHS_RXFIFOADD_ADDR(value)           (USBHS_RXFIFOADD_ADDR_Msk & (_UINT16_(value) << USBHS_RXFIFOADD_ADDR_Pos)) /* Assigment of value for ADDR in the USBHS_RXFIFOADD register */
#define USBHS_RXFIFOADD_Msk                   _UINT16_(0x1FFF)                                     /* (USBHS_RXFIFOADD) Register Mask  */


/* -------- USBHS_EPINFO : (USBHS Offset: 0x1078) ( R/ 8) Allows Read-Back Of The Number Of TX And RX Endpoints -------- */
#define USBHS_EPINFO_RESETVALUE               _UINT8_(0xFF)                                        /*  (USBHS_EPINFO) Allows Read-Back Of The Number Of TX And RX Endpoints  Reset Value */

#define USBHS_EPINFO_TXENDPOINTS_Pos          _UINT8_(0)                                           /* (USBHS_EPINFO) number of tx endpoints Position */
#define USBHS_EPINFO_TXENDPOINTS_Msk          (_UINT8_(0xF) << USBHS_EPINFO_TXENDPOINTS_Pos)       /* (USBHS_EPINFO) number of tx endpoints Mask */
#define USBHS_EPINFO_TXENDPOINTS(value)       (USBHS_EPINFO_TXENDPOINTS_Msk & (_UINT8_(value) << USBHS_EPINFO_TXENDPOINTS_Pos)) /* Assigment of value for TXENDPOINTS in the USBHS_EPINFO register */
#define USBHS_EPINFO_RXENDPOINTS_Pos          _UINT8_(4)                                           /* (USBHS_EPINFO) number of rx endpoints Position */
#define USBHS_EPINFO_RXENDPOINTS_Msk          (_UINT8_(0xF) << USBHS_EPINFO_RXENDPOINTS_Pos)       /* (USBHS_EPINFO) number of rx endpoints Mask */
#define USBHS_EPINFO_RXENDPOINTS(value)       (USBHS_EPINFO_RXENDPOINTS_Msk & (_UINT8_(value) << USBHS_EPINFO_RXENDPOINTS_Pos)) /* Assigment of value for RXENDPOINTS in the USBHS_EPINFO register */
#define USBHS_EPINFO_Msk                      _UINT8_(0xFF)                                        /* (USBHS_EPINFO) Register Mask  */


/* -------- USBHS_RAMINFO : (USBHS Offset: 0x1079) ( R/ 8) Details About Width Of RAM and DMA Channels -------- */
#define USBHS_RAMINFO_RESETVALUE              _UINT8_(0x8D)                                        /*  (USBHS_RAMINFO) Details About Width Of RAM and DMA Channels  Reset Value */

#define USBHS_RAMINFO_RAMBITS_Pos             _UINT8_(0)                                           /* (USBHS_RAMINFO) width of the ram address bus Position */
#define USBHS_RAMINFO_RAMBITS_Msk             (_UINT8_(0xF) << USBHS_RAMINFO_RAMBITS_Pos)          /* (USBHS_RAMINFO) width of the ram address bus Mask */
#define USBHS_RAMINFO_RAMBITS(value)          (USBHS_RAMINFO_RAMBITS_Msk & (_UINT8_(value) << USBHS_RAMINFO_RAMBITS_Pos)) /* Assigment of value for RAMBITS in the USBHS_RAMINFO register */
#define USBHS_RAMINFO_DMACHANS_Pos            _UINT8_(4)                                           /* (USBHS_RAMINFO) number of dma channels implemented in the design Position */
#define USBHS_RAMINFO_DMACHANS_Msk            (_UINT8_(0xF) << USBHS_RAMINFO_DMACHANS_Pos)         /* (USBHS_RAMINFO) number of dma channels implemented in the design Mask */
#define USBHS_RAMINFO_DMACHANS(value)         (USBHS_RAMINFO_DMACHANS_Msk & (_UINT8_(value) << USBHS_RAMINFO_DMACHANS_Pos)) /* Assigment of value for DMACHANS in the USBHS_RAMINFO register */
#define USBHS_RAMINFO_Msk                     _UINT8_(0xFF)                                        /* (USBHS_RAMINFO) Register Mask  */


