Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
#define USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos       _UINT32_(0)                                          /* (USBHS_RQPKTCOUNT) sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set. Position */
#define USBHS_RQPKTCOUNT_RQPKTCOUNT_Msk       (_UINT32_(0xFFFF) << USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos) /* (USBHS_RQPKTCOUNT) sets the number of packets of size maxp that are to be transferred in a block transfer. only used in host mode when autoreq is set. has no effect in peripheral mode or when autoreq is not set. Mask */
#define USBHS_RQPKTCOUNT_RQPKTCOUNT(value)    (USBHS_RQPKTCOUNT_RQPKTCOUNT_Msk & (_UINT32_(value) << USBHS_RQPKTCOUNT_RQPKTCOUNT_Pos)) /* Assigment of value for RQPKTCOUNT in the USBHS_RQPKTCOUNT register */
#define USBHS_RQPKTCOUNT_Msk                  _UINT32_(0x0000FFFF)                                 /* (USBHS_RQPKTCOUNT) Register Mask  */


/* -------- USBHS_RXDPKTBUFDIS : (USBHS Offset: 0x1340) (R/W 16) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality -------- */
#define USBHS_RXDPKTBUFDIS_RESETVALUE         _UINT16_(0x00)                                       /*  (USBHS_RXDPKTBUFDIS) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality  Reset Value */

#define USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos       _UINT16_(1)                                          /* (USBHS_RXDPKTBUFDIS) each bit indicates which of the Rx endpoint have disabled double buffer functionality Position */
#define USBHS_RXDPKTBUFDIS_EPxRXDIS_Msk       (_UINT16_(0x7FFF) << USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos) /* (USBHS_RXDPKTBUFDIS) each bit indicates which of the Rx endpoint have disabled double buffer functionality Mask */
#define USBHS_RXDPKTBUFDIS_EPxRXDIS(value)    (USBHS_RXDPKTBUFDIS_EPxRXDIS_Msk & (_UINT16_(value) << USBHS_RXDPKTBUFDIS_EPxRXDIS_Pos)) /* Assigment of value for EPxRXDIS in the USBHS_RXDPKTBUFDIS register */
#define USBHS_RXDPKTBUFDIS_Msk                _UINT16_(0xFFFE)                                     /* (USBHS_RXDPKTBUFDIS) Register Mask  */


/* -------- USBHS_TXDPKTBUFDIS : (USBHS Offset: 0x1342) (R/W 16) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality -------- */
#define USBHS_TXDPKTBUFDIS_RESETVALUE         _UINT16_(0x00)                                       /*  (USBHS_TXDPKTBUFDIS) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality  Reset Value */

#define USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos       _UINT16_(1)                                          /* (USBHS_TXDPKTBUFDIS) each bit indicates which of the Tx endpoint have disabled double buffer functionality Position */
#define USBHS_TXDPKTBUFDIS_EPxTXDIS_Msk       (_UINT16_(0x7FFF) << USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos) /* (USBHS_TXDPKTBUFDIS) each bit indicates which of the Tx endpoint have disabled double buffer functionality Mask */
#define USBHS_TXDPKTBUFDIS_EPxTXDIS(value)    (USBHS_TXDPKTBUFDIS_EPxTXDIS_Msk & (_UINT16_(value) << USBHS_TXDPKTBUFDIS_EPxTXDIS_Pos)) /* Assigment of value for EPxTXDIS in the USBHS_TXDPKTBUFDIS register */
#define USBHS_TXDPKTBUFDIS_Msk                _UINT16_(0xFFFE)                                     /* (USBHS_TXDPKTBUFDIS) Register Mask  */


/* -------- USBHS_CTUCH : (USBHS Offset: 0x1344) (R/W 16) Chirp Timeout. Number Of XCLK Cycles Before The Timeout -------- */
#define USBHS_CTUCH_RESETVALUE                _UINT16_(0x4074)                                     /*  (USBHS_CTUCH) Chirp Timeout. Number Of XCLK Cycles Before The Timeout  Reset Value */

#define USBHS_CTUCH_CTUCH_Pos                 _UINT16_(0)                                          /* (USBHS_CTUCH) this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs Position */
#define USBHS_CTUCH_CTUCH_Msk                 (_UINT16_(0xFFFF) << USBHS_CTUCH_CTUCH_Pos)          /* (USBHS_CTUCH) this number when multiplied by 4 represents the number of xclk cycles before the timeout occurs Mask */
#define USBHS_CTUCH_CTUCH(value)              (USBHS_CTUCH_CTUCH_Msk & (_UINT16_(value) << USBHS_CTUCH_CTUCH_Pos)) /* Assigment of value for CTUCH in the USBHS_CTUCH register */
#define USBHS_CTUCH_Msk                       _UINT16_(0xFFFF)                                     /* (USBHS_CTUCH) Register Mask  */


/* -------- USBHS_CTHHSRTN : (USBHS Offset: 0x1346) (R/W 16) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode -------- */
#define USBHS_CTHHSRTN_RESETVALUE             _UINT16_(0x32)                                       /*  (USBHS_CTHHSRTN) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode  Reset Value */

#define USBHS_CTHHSRTN_CTHHSRTN_Pos           _UINT16_(0)                                          /* (USBHS_CTHHSRTN) the delay from the end of high speed resume signaling to enabling utm normal operating mode. Position */
#define USBHS_CTHHSRTN_CTHHSRTN_Msk           (_UINT16_(0xFFFF) << USBHS_CTHHSRTN_CTHHSRTN_Pos)    /* (USBHS_CTHHSRTN) the delay from the end of high speed resume signaling to enabling utm normal operating mode. Mask */
#define USBHS_CTHHSRTN_CTHHSRTN(value)        (USBHS_CTHHSRTN_CTHHSRTN_Msk & (_UINT16_(value) << USBHS_CTHHSRTN_CTHHSRTN_Pos)) /* Assigment of value for CTHHSRTN in the USBHS_CTHHSRTN register */
#define USBHS_CTHHSRTN_Msk                    _UINT16_(0xFFFF)                                     /* (USBHS_CTHHSRTN) Register Mask  */


/* -------- USBHS_CTHSBT : (USBHS Offset: 0x1348) (R/W 16) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times. -------- */
#define USBHS_CTHSBT_RESETVALUE               _UINT16_(0x00)                                       /*  (USBHS_CTHSBT) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times.  Reset Value */

#define USBHS_CTHSBT_HSTMEOUTADD_Pos          _UINT16_(0)                                          /* (USBHS_CTHSBT) this register represents the value to be added to the mimumum high speed timeout period of 736 bit times Position */
#define USBHS_CTHSBT_HSTMEOUTADD_Msk          (_UINT16_(0xF) << USBHS_CTHSBT_HSTMEOUTADD_Pos)      /* (USBHS_CTHSBT) this register represents the value to be added to the mimumum high speed timeout period of 736 bit times Mask */
#define USBHS_CTHSBT_HSTMEOUTADD(value)       (USBHS_CTHSBT_HSTMEOUTADD_Msk & (_UINT16_(value) << USBHS_CTHSBT_HSTMEOUTADD_Pos)) /* Assigment of value for HSTMEOUTADD in the USBHS_CTHSBT register */
#define USBHS_CTHSBT_Msk                      _UINT16_(0x000F)                                     /* (USBHS_CTHSBT) Register Mask  */


/* -------- USBHS_LPMATTR : (USBHS Offset: 0x1360) (R/W 16) Defines The Attributes Of An LPM Transaction And Sleep Cycle. -------- */
#define USBHS_LPMATTR_RESETVALUE              _UINT16_(0x00)                                       /*  (USBHS_LPMATTR) Defines The Attributes Of An LPM Transaction And Sleep Cycle.  Reset Value */

#define USBHS_LPMATTR_LINKSTATE_Pos           _UINT16_(0)                                          /* (USBHS_LPMATTR) this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction. Position */
#define USBHS_LPMATTR_LINKSTATE_Msk           (_UINT16_(0xF) << USBHS_LPMATTR_LINKSTATE_Pos)       /* (USBHS_LPMATTR) this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction. Mask */
#define USBHS_LPMATTR_LINKSTATE(value)        (USBHS_LPMATTR_LINKSTATE_Msk & (_UINT16_(value) << USBHS_LPMATTR_LINKSTATE_Pos)) /* Assigment of value for LINKSTATE in the USBHS_LPMATTR register */
#define   USBHS_LPMATTR_LINKSTATE_SLEEPSTATE_Val _UINT16_(0x1)                                        /* (USBHS_LPMATTR) Sleep State (L1)  */
#define USBHS_LPMATTR_LINKSTATE_SLEEPSTATE    (USBHS_LPMATTR_LINKSTATE_SLEEPSTATE_Val << USBHS_LPMATTR_LINKSTATE_Pos) /* (USBHS_LPMATTR) Sleep State (L1) Position  */
#define USBHS_LPMATTR_HIRD_Pos                _UINT16_(4)                                          /* (USBHS_LPMATTR) this is the host initiated resume duration. Position */
#define USBHS_LPMATTR_HIRD_Msk                (_UINT16_(0xF) << USBHS_LPMATTR_HIRD_Pos)            /* (USBHS_LPMATTR) this is the host initiated resume duration. Mask */
#define USBHS_LPMATTR_HIRD(value)             (USBHS_LPMATTR_HIRD_Msk & (_UINT16_(value) << USBHS_LPMATTR_HIRD_Pos)) /* Assigment of value for HIRD in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_RMTWAK_Pos              _UINT16_(8)                                          /* (USBHS_LPMATTR) this bit is the remote wakeup enable bit. Position */
#define USBHS_LPMATTR_RMTWAK_Msk              (_UINT16_(0x1) << USBHS_LPMATTR_RMTWAK_Pos)          /* (USBHS_LPMATTR) this bit is the remote wakeup enable bit. Mask */
#define USBHS_LPMATTR_RMTWAK(value)           (USBHS_LPMATTR_RMTWAK_Msk & (_UINT16_(value) << USBHS_LPMATTR_RMTWAK_Pos)) /* Assigment of value for RMTWAK in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_ENDPOINT_Pos            _UINT16_(12)                                         /* (USBHS_LPMATTR) this is the endpnt that in the token packet of the lpm transaction. Position */
#define USBHS_LPMATTR_ENDPOINT_Msk            (_UINT16_(0xF) << USBHS_LPMATTR_ENDPOINT_Pos)        /* (USBHS_LPMATTR) this is the endpnt that in the token packet of the lpm transaction. Mask */
#define USBHS_LPMATTR_ENDPOINT(value)         (USBHS_LPMATTR_ENDPOINT_Msk & (_UINT16_(value) << USBHS_LPMATTR_ENDPOINT_Pos)) /* Assigment of value for ENDPOINT in the USBHS_LPMATTR register */
#define USBHS_LPMATTR_Msk                     _UINT16_(0xF1FF)                                     /* (USBHS_LPMATTR) Register Mask  */


/* -------- USBHS_LPMCNTRL : (USBHS Offset: 0x1362) (R/W 8) LPM Control Register -------- */
#define USBHS_LPMCNTRL_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_LPMCNTRL) LPM Control Register  Reset Value */

#define USBHS_LPMCNTRL_Msk                    _UINT8_(0x00)                                        /* (USBHS_LPMCNTRL) Register Mask  */

/* HOST mode */
#define USBHS_LPMCNTRL_HOST_LPMXMT_Pos        _UINT8_(0)                                           /* (USBHS_LPMCNTRL) software should set this bit to transmit an lpm transaction. Position */
#define USBHS_LPMCNTRL_HOST_LPMXMT_Msk        (_UINT8_(0x1) << USBHS_LPMCNTRL_HOST_LPMXMT_Pos)     /* (USBHS_LPMCNTRL) software should set this bit to transmit an lpm transaction. Mask */
#define USBHS_LPMCNTRL_HOST_LPMXMT(value)     (USBHS_LPMCNTRL_HOST_LPMXMT_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_HOST_LPMXMT_Pos))
#define USBHS_LPMCNTRL_HOST_LPMRES_Pos        _UINT8_(1)                                           /* (USBHS_LPMCNTRL) this bit is used by software to initiate a resume from the l1 state Position */
#define USBHS_LPMCNTRL_HOST_LPMRES_Msk        (_UINT8_(0x1) << USBHS_LPMCNTRL_HOST_LPMRES_Pos)     /* (USBHS_LPMCNTRL) this bit is used by software to initiate a resume from the l1 state Mask */
#define USBHS_LPMCNTRL_HOST_LPMRES(value)     (USBHS_LPMCNTRL_HOST_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_HOST_LPMRES_Pos))
#define USBHS_LPMCNTRL_HOST_Msk               _UINT8_(0x03)                                         /* (USBHS_LPMCNTRL_HOST) Register Mask  */

/* PERIPHERAL mode */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos  _UINT8_(0)                                           /* (USBHS_LPMCNTRL) this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos) /* (USBHS_LPMCNTRL) this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMXMT(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMXMT_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos  _UINT8_(1)                                           /* (USBHS_LPMCNTRL) this bit is used by software to initiate resume (remote wakeup). Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos) /* (USBHS_LPMCNTRL) this bit is used by software to initiate resume (remote wakeup). Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMRES(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMRES_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos   _UINT8_(2)                                           /* (USBHS_LPMCNTRL) this register is used to enable lpm in the musbmhdrc. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Msk   (_UINT8_(0x3) << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) this register is used to enable lpm in the musbmhdrc. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos))
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS_Val _UINT8_(0x0)                                         /* (USBHS_LPMCNTRL) Core supports LPM extended transactions  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS_Val _UINT8_(0x1)                                         /* (USBHS_LPMCNTRL) LPM is not supported but extended transactions are supported.  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1_Val _UINT8_(0x2)                                         /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported  */
#define   USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2_Val _UINT8_(0x3)                                         /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_LPMTRANS_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) Core supports LPM extended transactions Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_EXTNTRANS_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM is not supported but extended transactions are supported. Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1 (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED1_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2 (USBHS_LPMCNTRL_PERIPHERAL_LPMEN_NOTSUPPORTED2_Val << USBHS_LPMCNTRL_PERIPHERAL_LPMEN_Pos) /* (USBHS_LPMCNTRL) LPM and extended transactions are not supported Position  */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos  _UINT8_(4)                                           /* (USBHS_LPMCNTRL) this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak. Position */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Msk  (_UINT8_(0x1) << USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos) /* (USBHS_LPMCNTRL) this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak. Mask */
#define USBHS_LPMCNTRL_PERIPHERAL_LPMNAK(value) (USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Msk & (_UINT8_(value) << USBHS_LPMCNTRL_PERIPHERAL_LPMNAK_Pos))
#define USBHS_LPMCNTRL_PERIPHERAL_Msk         _UINT8_(0x1F)                                         /* (USBHS_LPMCNTRL_PERIPHERAL) Register Mask  */


