Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/usbhs.h
#define USBHS_PHY18_ODT21_Pos                 _UINT32_(0)                                          /* (USBHS_PHY18) Upper 3 bits for on die termination compensation voltage reference Position */
#define USBHS_PHY18_ODT21_Msk                 (_UINT32_(0x3) << USBHS_PHY18_ODT21_Pos)             /* (USBHS_PHY18) Upper 3 bits for on die termination compensation voltage reference Mask */
#define USBHS_PHY18_ODT21(value)              (USBHS_PHY18_ODT21_Msk & (_UINT32_(value) << USBHS_PHY18_ODT21_Pos)) /* Assigment of value for ODT21 in the USBHS_PHY18 register */
#define USBHS_PHY18_RSVD0_Pos                 _UINT32_(2)                                          /* (USBHS_PHY18) reserved Position */
#define USBHS_PHY18_RSVD0_Msk                 (_UINT32_(0xF) << USBHS_PHY18_RSVD0_Pos)             /* (USBHS_PHY18) reserved Mask */
#define USBHS_PHY18_RSVD0(value)              (USBHS_PHY18_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY18_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY18 register */
#define USBHS_PHY18_Msk                       _UINT32_(0x0000003F)                                 /* (USBHS_PHY18) Register Mask  */


/* -------- USBHS_PHY1C : (USBHS Offset: 0x151C) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY1C_RESETVALUE                _UINT32_(0x82)                                       /*  (USBHS_PHY1C) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY1C_RSVD0_Pos                 _UINT32_(0)                                          /* (USBHS_PHY1C) reserved Position */
#define USBHS_PHY1C_RSVD0_Msk                 (_UINT32_(0x1) << USBHS_PHY1C_RSVD0_Pos)             /* (USBHS_PHY1C) reserved Mask */
#define USBHS_PHY1C_RSVD0(value)              (USBHS_PHY1C_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY1C_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY1C register */
#define USBHS_PHY1C_ODTBYPASS_Pos             _UINT32_(1)                                          /* (USBHS_PHY1C) ODT auto-refresh bypass Position */
#define USBHS_PHY1C_ODTBYPASS_Msk             (_UINT32_(0x1) << USBHS_PHY1C_ODTBYPASS_Pos)         /* (USBHS_PHY1C) ODT auto-refresh bypass Mask */
#define USBHS_PHY1C_ODTBYPASS(value)          (USBHS_PHY1C_ODTBYPASS_Msk & (_UINT32_(value) << USBHS_PHY1C_ODTBYPASS_Pos)) /* Assigment of value for ODTBYPASS in the USBHS_PHY1C register */
#define USBHS_PHY1C_RSVD1_Pos                 _UINT32_(2)                                          /* (USBHS_PHY1C) reserved Position */
#define USBHS_PHY1C_RSVD1_Msk                 (_UINT32_(0x1F) << USBHS_PHY1C_RSVD1_Pos)            /* (USBHS_PHY1C) reserved Mask */
#define USBHS_PHY1C_RSVD1(value)              (USBHS_PHY1C_RSVD1_Msk & (_UINT32_(value) << USBHS_PHY1C_RSVD1_Pos)) /* Assigment of value for RSVD1 in the USBHS_PHY1C register */
#define USBHS_PHY1C_FSLSDIFF_Pos              _UINT32_(7)                                          /* (USBHS_PHY1C) Turn off FS/LS differential receiver in suspend mode Position */
#define USBHS_PHY1C_FSLSDIFF_Msk              (_UINT32_(0x1) << USBHS_PHY1C_FSLSDIFF_Pos)          /* (USBHS_PHY1C) Turn off FS/LS differential receiver in suspend mode Mask */
#define USBHS_PHY1C_FSLSDIFF(value)           (USBHS_PHY1C_FSLSDIFF_Msk & (_UINT32_(value) << USBHS_PHY1C_FSLSDIFF_Pos)) /* Assigment of value for FSLSDIFF in the USBHS_PHY1C register */
#define USBHS_PHY1C_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY1C) Register Mask  */

#define USBHS_PHY1C_RSVD_Pos                  _UINT32_(0)                                          /* (USBHS_PHY1C Position) reserved */
#define USBHS_PHY1C_RSVD_Msk                  (_UINT32_(0x1) << USBHS_PHY1C_RSVD_Pos)              /* (USBHS_PHY1C Mask) RSVD */
#define USBHS_PHY1C_RSVD(value)               (USBHS_PHY1C_RSVD_Msk & (_UINT32_(value) << USBHS_PHY1C_RSVD_Pos)) 

/* -------- USBHS_PHY20 : (USBHS Offset: 0x1520) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY20_RESETVALUE                _UINT32_(0x80)                                       /*  (USBHS_PHY20) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY20_RSVD0_Pos                 _UINT32_(0)                                          /* (USBHS_PHY20) Reserved Position */
#define USBHS_PHY20_RSVD0_Msk                 (_UINT32_(0x3F) << USBHS_PHY20_RSVD0_Pos)            /* (USBHS_PHY20) Reserved Mask */
#define USBHS_PHY20_RSVD0(value)              (USBHS_PHY20_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY20_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY20 register */
#define USBHS_PHY20_HSSLEW10_Pos              _UINT32_(6)                                          /* (USBHS_PHY20) Lower 2 bits for HS slew adjust rate Position */
#define USBHS_PHY20_HSSLEW10_Msk              (_UINT32_(0x3) << USBHS_PHY20_HSSLEW10_Pos)          /* (USBHS_PHY20) Lower 2 bits for HS slew adjust rate Mask */
#define USBHS_PHY20_HSSLEW10(value)           (USBHS_PHY20_HSSLEW10_Msk & (_UINT32_(value) << USBHS_PHY20_HSSLEW10_Pos)) /* Assigment of value for HSSLEW10 in the USBHS_PHY20 register */
#define USBHS_PHY20_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY20) Register Mask  */


/* -------- USBHS_PHY24 : (USBHS Offset: 0x1524) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY24_RESETVALUE                _UINT32_(0x0C)                                       /*  (USBHS_PHY24) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY24_HSSLEW2_Pos               _UINT32_(0)                                          /* (USBHS_PHY24) MSB of HS slew rate adjust Position */
#define USBHS_PHY24_HSSLEW2_Msk               (_UINT32_(0x1) << USBHS_PHY24_HSSLEW2_Pos)           /* (USBHS_PHY24) MSB of HS slew rate adjust Mask */
#define USBHS_PHY24_HSSLEW2(value)            (USBHS_PHY24_HSSLEW2_Msk & (_UINT32_(value) << USBHS_PHY24_HSSLEW2_Pos)) /* Assigment of value for HSSLEW2 in the USBHS_PHY24 register */
#define USBHS_PHY24_RSVD0_Pos                 _UINT32_(2)                                          /* (USBHS_PHY24) Reserved Position */
#define USBHS_PHY24_RSVD0_Msk                 (_UINT32_(0x1) << USBHS_PHY24_RSVD0_Pos)             /* (USBHS_PHY24) Reserved Mask */
#define USBHS_PHY24_RSVD0(value)              (USBHS_PHY24_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY24_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY24 register */
#define USBHS_PHY24_HSPREEMPST_Pos            _UINT32_(3)                                          /* (USBHS_PHY24) HS transmit pre emphasis strength Position */
#define USBHS_PHY24_HSPREEMPST_Msk            (_UINT32_(0x7) << USBHS_PHY24_HSPREEMPST_Pos)        /* (USBHS_PHY24) HS transmit pre emphasis strength Mask */
#define USBHS_PHY24_HSPREEMPST(value)         (USBHS_PHY24_HSPREEMPST_Msk & (_UINT32_(value) << USBHS_PHY24_HSPREEMPST_Pos)) /* Assigment of value for HSPREEMPST in the USBHS_PHY24 register */
#define USBHS_PHY24_HSDRIVST10_Pos            _UINT32_(6)                                          /* (USBHS_PHY24) HS transmit drive strength Position */
#define USBHS_PHY24_HSDRIVST10_Msk            (_UINT32_(0x3) << USBHS_PHY24_HSDRIVST10_Pos)        /* (USBHS_PHY24) HS transmit drive strength Mask */
#define USBHS_PHY24_HSDRIVST10(value)         (USBHS_PHY24_HSDRIVST10_Msk & (_UINT32_(value) << USBHS_PHY24_HSDRIVST10_Pos)) /* Assigment of value for HSDRIVST10 in the USBHS_PHY24 register */
#define USBHS_PHY24_Msk                       _UINT32_(0x000000FD)                                 /* (USBHS_PHY24) Register Mask  */

#define USBHS_PHY24_HSSLEW_Pos                _UINT32_(0)                                          /* (USBHS_PHY24 Position) MSB of HS slew rate adjust */
#define USBHS_PHY24_HSSLEW_Msk                (_UINT32_(0x1) << USBHS_PHY24_HSSLEW_Pos)            /* (USBHS_PHY24 Mask) HSSLEW */
#define USBHS_PHY24_HSSLEW(value)             (USBHS_PHY24_HSSLEW_Msk & (_UINT32_(value) << USBHS_PHY24_HSSLEW_Pos)) 
#define USBHS_PHY24_RSVD_Pos                  _UINT32_(2)                                          /* (USBHS_PHY24 Position) Reserved */
#define USBHS_PHY24_RSVD_Msk                  (_UINT32_(0x1) << USBHS_PHY24_RSVD_Pos)              /* (USBHS_PHY24 Mask) RSVD */
#define USBHS_PHY24_RSVD(value)               (USBHS_PHY24_RSVD_Msk & (_UINT32_(value) << USBHS_PHY24_RSVD_Pos)) 

/* -------- USBHS_PHY28 : (USBHS Offset: 0x1528) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY28_RESETVALUE                _UINT32_(0x1B)                                       /*  (USBHS_PHY28) USBHPHY Control Register.  Reset Value */

